renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/5_ADC_driver/Exercises/ADC_Exercise4_ADC1_2Pots_2Samples_Average/Autosar/Mcal/Base/header/S32K118_M0P.svd
        <register>
          <name>SOSCCSR</name>
          <description>System OSC Control Status Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOSCEN</name>
              <description>System OSC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCEN_0</name>
                  <description>System OSC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCEN_1</name>
                  <description>System OSC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCCM</name>
              <description>System OSC Clock Monitor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCCM_0</name>
                  <description>System OSC Clock Monitor is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCCM_1</name>
                  <description>System OSC Clock Monitor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCCMRE</name>
              <description>System OSC Clock Monitor Reset Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCCMRE_0</name>
                  <description>Clock Monitor generates interrupt when error detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCCMRE_1</name>
                  <description>Clock Monitor generates reset when error detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LK_0</name>
                  <description>This Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LK_1</name>
                  <description>This Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCVLD</name>
              <description>System OSC Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCVLD_0</name>
                  <description>System OSC is not enabled or clock is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCVLD_1</name>
                  <description>System OSC is enabled and output clock is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCSEL</name>
              <description>System OSC Selected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCSEL_0</name>
                  <description>System OSC is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCSEL_1</name>
                  <description>System OSC is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCERR</name>
              <description>System OSC Clock Error</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCERR_0</name>
                  <description>System OSC Clock Monitor is disabled or has not detected an error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCERR_1</name>
                  <description>System OSC Clock Monitor is enabled and detected an error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOSCDIV</name>
          <description>System OSC Divide Register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SOSCDIV1</name>
              <description>System OSC Clock Divide 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCDIV1_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV1_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOSCDIV2</name>
              <description>System OSC Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SOSCDIV2_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SOSCDIV2_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SOSCCFG</name>
          <description>System Oscillator Configuration Register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x10</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EREFS</name>
              <description>External Reference Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EREFS_0</name>
                  <description>External reference clock selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EREFS_1</name>
                  <description>Internal crystal oscillator of OSC selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HGO</name>
              <description>High Gain Oscillator Select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HGO_0</name>
                  <description>Configure crystal oscillator for low-gain operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HGO_1</name>
                  <description>Configure crystal oscillator for high-gain operation</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RANGE</name>
              <description>System OSC Range Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE_1</name>
                  <description>Low frequency range selected for the crystal oscillator</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE_2</name>
                  <description>Medium frequency range selected for the crytstal oscillator</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE_3</name>
                  <description>High frequency range selected for the crystal oscillator</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIRCCSR</name>
          <description>Slow IRC Control Status Register</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1000005</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIRCEN</name>
              <description>Slow IRC Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCEN_0</name>
                  <description>Slow IRC is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCEN_1</name>
                  <description>Slow IRC is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCSTEN</name>
              <description>Slow IRC Stop Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCSTEN_0</name>
                  <description>Slow IRC is disabled in supported Stop modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCSTEN_1</name>
                  <description>Slow IRC is enabled in supported Stop modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCLPEN</name>
              <description>Slow IRC Low Power Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCLPEN_0</name>
                  <description>Slow IRC is disabled in VLP modes</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCLPEN_1</name>
                  <description>Slow IRC is enabled in VLP modes</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LK</name>
              <description>Lock Register</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LK_0</name>
                  <description>Control Status Register can be written.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LK_1</name>
                  <description>Control Status Register cannot be written.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCVLD</name>
              <description>Slow IRC Valid</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCVLD_0</name>
                  <description>Slow IRC is not enabled or clock is not valid</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCVLD_1</name>
                  <description>Slow IRC is enabled and output clock is valid</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCSEL</name>
              <description>Slow IRC Selected</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCSEL_0</name>
                  <description>Slow IRC is not the system clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCSEL_1</name>
                  <description>Slow IRC is the system clock source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIRCDIV</name>
          <description>Slow IRC Divide Register</description>
          <addressOffset>0x204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SIRCDIV1</name>
              <description>Slow IRC Clock Divide 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCDIV1_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV1_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SIRCDIV2</name>
              <description>Slow IRC Clock Divide 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIRCDIV2_0</name>
                  <description>Output disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_3</name>
                  <description>Divide by 4</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_4</name>
                  <description>Divide by 8</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_5</name>
                  <description>Divide by 16</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_6</name>
                  <description>Divide by 32</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIRCDIV2_7</name>
                  <description>Divide by 64</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SIRCCFG</name>
          <description>Slow IRC Configuration Register</description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RANGE</name>
              <description>Frequency Range</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RANGE_0</name>
                  <description>Slow IRC low range clock (2 MHz)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RANGE_1</name>
                  <description>Slow IRC high range clock (8 MHz )</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
