renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/5_ADC_driver/Exercises/ADC_Exercise4_ADC1_2Pots_2Samples_Average/Autosar/Mcal/Base/header/S32K118_M0P.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="LPUART0">
      <name>LPUART1</name>
      <description>LPUART</description>
      <groupName>LPUART</groupName>
      <baseAddress>0x4006B000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x30</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>CMP0</name>
      <description>High-Speed Comparator (CMP), Voltage Reference (VREF) Digital-to-Analog Converter (DAC), and Analog Mux (ANMUX)</description>
      <groupName>CMP</groupName>
      <prependToName>CMP0_</prependToName>
      <baseAddress>0x40073000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xC</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>C0</name>
          <description>CMP Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HYSTCTR</name>
              <description>Comparator hard block hysteresis control. See chip data sheet to get the actual hysteresis value with each level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HYSTCTR_0</name>
                  <description>The hard block output has level 0 hysteresis internally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTCTR_1</name>
                  <description>The hard block output has level 1 hysteresis internally.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTCTR_2</name>
                  <description>The hard block output has level 2 hysteresis internally.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HYSTCTR_3</name>
                  <description>The hard block output has level 3 hysteresis internally.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OFFSET</name>
              <description>Comparator hard block offset control. See chip data sheet to get the actual offset value with each level</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFFSET_0</name>
                  <description>The comparator hard block output has level 0 offset internally.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFFSET_1</name>
                  <description>The comparator hard block output has level 1 offset internally.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTER_CNT</name>
              <description>Filter Sample Count</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FILTER_CNT_0</name>
                  <description>Filter is disabled. If SE = 1, then COUT is a logic zero (this is not a legal state, and is not recommended). If SE = 0, COUT = COUTA.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_1</name>
                  <description>1 consecutive sample must agree (comparator output is simply sampled).</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_2</name>
                  <description>2 consecutive samples must agree.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_3</name>
                  <description>3 consecutive samples must agree.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_4</name>
                  <description>4 consecutive samples must agree.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_5</name>
                  <description>5 consecutive samples must agree.</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_6</name>
                  <description>6 consecutive samples must agree.</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER_CNT_7</name>
                  <description>7 consecutive samples must agree.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EN</name>
              <description>Comparator Module Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>EN_0</name>
                  <description>Analog Comparator is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN_1</name>
                  <description>Analog Comparator is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPE</name>
              <description>Comparator Output Pin Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OPE_0</name>
                  <description>When OPE is 0, the comparator output (after window/filter settings dependent on software configuration) is not available to a packaged pin.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OPE_1</name>
                  <description>When OPE is 1, and if the software has configured the comparator to own a packaged pin, the comparator is available in a packaged pin.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COS</name>
              <description>Comparator Output Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COS_0</name>
                  <description>Set CMPO to equal COUT (filtered comparator output).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COS_1</name>
                  <description>Set CMPO to equal COUTA (unfiltered comparator output).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVT</name>
              <description>Comparator invert</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INVT_0</name>
                  <description>Does not invert the comparator output.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVT_1</name>
                  <description>Inverts the comparator output.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PMODE</name>
              <description>Power Mode Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PMODE_0</name>
                  <description>Low Speed (LS) comparison mode is selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMODE_1</name>
                  <description>High Speed (HS) comparison mode is selected, in VLPx mode, or Stop mode switched to Low Speed (LS) mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WE</name>
              <description>Windowing Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WE_0</name>
                  <description>Windowing mode is not selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WE_1</name>
                  <description>Windowing mode is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SE</name>
              <description>Sample Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SE_0</name>
                  <description>Sampling mode is not selected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SE_1</name>
                  <description>Sampling mode is selected.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FPR</name>
              <description>Filter Sample Period</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUT</name>
              <description>Analog Comparator Output</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CFF</name>
              <description>Analog Comparator Flag Falling</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFF_0</name>
                  <description>A falling edge has not been detected on COUT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFF_1</name>
                  <description>A falling edge on COUT has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFR</name>
              <description>Analog Comparator Flag Rising</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CFR_0</name>
                  <description>A rising edge has not been detected on COUT.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFR_1</name>
                  <description>A rising edge on COUT has occurred.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IEF</name>
              <description>Comparator Interrupt Enable Falling</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IEF_0</name>
                  <description>Interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IEF_1</name>
                  <description>Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IER</name>
              <description>Comparator Interrupt Enable Rising</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IER_0</name>
                  <description>Interrupt is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IER_1</name>
                  <description>Interrupt is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA Enable</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMAEN_0</name>
                  <description>DMA is disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMAEN_1</name>
                  <description>DMA is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
