renatosoriano/AUTOSAR-MCAL-Embedded-Upskilling-Bootcamp/Tresos_Workspace/5_ADC_driver/Exercises/ADC_Exercise4_ADC1_2Pots_2Samples_Average/Autosar/Mcal/Base/header/S32K118_M0P.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MCM</name>
      <description>Core Platform Miscellaneous Control Module</description>
      <groupName>MCM</groupName>
      <prependToName>MCM_</prependToName>
      <baseAddress>0xF0003000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4A8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>PLASC</name>
          <description>Crossbar Switch (AXBS) Slave Configuration</description>
          <addressOffset>0x8</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ASC</name>
              <description>Each bit in the ASC field indicates whether there is a corresponding connection to the crossbar switch's slave input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASC_0</name>
                  <description>A bus slave connection to AXBS input port n is absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASC_1</name>
                  <description>A bus slave connection to AXBS input port n is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAMC</name>
          <description>Crossbar Switch (AXBS) Master Configuration</description>
          <addressOffset>0xA</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x7</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>AMC</name>
              <description>Each bit in the AMC field indicates whether there is a corresponding connection to the AXBS master input port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AMC_0</name>
                  <description>A bus master connection to AXBS input port n is absent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AMC_1</name>
                  <description>A bus master connection to AXBS input port n is present</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPCR</name>
          <description>Core Platform Control Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFAF</resetMask>
          <fields>
            <field>
              <name>HLT_FSM_ST</name>
              <description>AXBS Halt State Machine Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HLT_FSM_ST_0</name>
                  <description>Waiting for request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLT_FSM_ST_1</name>
                  <description>Waiting for platform idle</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLT_FSM_ST_2</name>
                  <description>Unused state</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HLT_FSM_ST_3</name>
                  <description>Platform stalled</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_HLT_REQ</name>
              <description>AXBS Halt Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_HLT_REQ_0</name>
                  <description>AXBS is not receiving halt request</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_HLT_REQ_1</name>
                  <description>AXBS is receiving halt request</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AXBS_HLTD</name>
              <description>AXBS Halted</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AXBS_HLTD_0</name>
                  <description>AXBS is not currently halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AXBS_HLTD_1</name>
                  <description>AXBS is currently halted</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FMC_PF_IDLE</name>
              <description>Flash Memory Controller Program Flash Idle</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FMC_PF_IDLE_0</name>
                  <description>FMC program flash is not idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FMC_PF_IDLE_1</name>
                  <description>FMC program flash is currently idle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PBRIDGE_IDLE</name>
              <description>Peripheral Bridge Idle</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PBRIDGE_IDLE_0</name>
                  <description>PBRIDGE is not idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBRIDGE_IDLE_1</name>
                  <description>PBRIDGE is currently idle</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBRR</name>
              <description>Crossbar Round-robin Arbitration Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBRR_0</name>
                  <description>Fixed-priority arbitration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBRR_1</name>
                  <description>Round-robin arbitration</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PID</name>
          <description>Process ID Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PID</name>
              <description>M0_PID and M1_PID for MPU</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CPO</name>
          <description>Compute Operation Control Register</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CPOREQ</name>
              <description>Compute Operation Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPOREQ_0</name>
                  <description>Request is cleared.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPOREQ_1</name>
                  <description>Request Compute Operation.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOACK</name>
              <description>Compute Operation Acknowledge</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPOACK_0</name>
                  <description>Compute operation entry has not completed or compute operation exit has completed.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPOACK_1</name>
                  <description>Compute operation entry has completed or compute operation exit has not completed.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPOWOI</name>
              <description>Compute Operation Wakeup On Interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPOWOI_0</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPOWOI_1</name>
                  <description>When set, the CPOREQ is cleared on any interrupt or exception vector fetch.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>LMDR%s</name>
          <description>Local Memory Descriptor Register</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0</resetMask>
          <fields>
            <field>
              <name>CF0</name>
              <description>Control Field 0 LMDR0[CF0] bit field is Reserved and Read-Only 0 for S32K11x variants.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MT</name>
              <description>Memory Type</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MT_0</name>
                  <description>SRAM_L</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MT_1</name>
                  <description>SRAM_U</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DPW</name>
              <description>LMEM Data Path Width. This field defines the width of the local memory.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DPW_2</name>
                  <description>LMEMn 32-bits wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPW_3</name>
                  <description>LMEMn 64-bits wide</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WY</name>
              <description>Level 1 Cache Ways</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WY_0</name>
                  <description>No Cache</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_2</name>
                  <description>2-Way Set Associative</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WY_4</name>
                  <description>4-Way Set Associative</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZ</name>
              <description>LMEM Size</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZ_0</name>
                  <description>no LMEMn (0 KB)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_1</name>
                  <description>1 KB LMEMn</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_2</name>
                  <description>2 KB LMEMn</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_3</name>
                  <description>4 KB LMEMn</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_4</name>
                  <description>8 KB LMEMn</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_5</name>
                  <description>16 KB LMEMn</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_6</name>
                  <description>32 KB LMEMn</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_7</name>
                  <description>64 KB LMEMn</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_8</name>
                  <description>128 KB LMEMn</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_9</name>
                  <description>256 KB LMEMn</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_10</name>
                  <description>512 KB LMEMn</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_11</name>
                  <description>1024 KB LMEMn</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_12</name>
                  <description>2048 KB LMEMn</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_13</name>
                  <description>4096 KB LMEMn</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_14</name>
                  <description>8192 KB LMEMn</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZ_15</name>
                  <description>16384 KB LMEMn</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LMSZH</name>
              <description>LMEM Size Hole</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LMSZH_0</name>
                  <description>LMEMn is a power-of-2 capacity.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LMSZH_1</name>
                  <description>LMEMn is not a power-of-2, with a capacity is 0.75 * LMSZ.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>Local Memory Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>V_0</name>
                  <description>LMEMn is not present.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>V_1</name>
                  <description>LMEMn is present.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LMPECR</name>
          <description>LMEM Parity and ECC Control Register</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <register>
          <name>LMPEIR</name>
          <description>LMEM Parity and ECC Interrupt Register</description>
          <addressOffset>0x488</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENC</name>
              <description>ENCn = ECC Noncorrectable Error n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>E1B</name>
              <description>E1Bn = ECC 1-bit Error n</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
            </field>
            <field>
              <name>PEELOC</name>
              <description>Parity or ECC Error Location</description>
              <bitOffset>24</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PEELOC_0</name>
                  <description>Non-correctable ECC event from SRAM_L</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEELOC_1</name>
                  <description>Non-correctable ECC event from SRAM_U</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEELOC_8</name>
                  <description>1-bit correctable ECC event from SRAM_L</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEELOC_9</name>
                  <description>1-bit correctable ECC event from SRAM_U</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEELOC_14</name>
                  <description>PC tag parity error</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PEELOC_15</name>
                  <description>PC data parity error</description>
                  <value>0xF</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>V</name>
              <description>Valid Bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LMFAR</name>
          <description>LMEM Fault Address Register</description>
          <addressOffset>0x490</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EFADD</name>
              <description>ECC Fault Address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
